In [1]:
import json
import pandas as pd

# Extract Data

In [2]:
employees_1 = pd.read_csv('employees.csv')
employees_1

   id           name department  salary
0   1  Alice Johnson    Finance   50091
1   2  Alice Johnson         IT   57010
2   3  Alice Johnson    Finance   78148

In [3]:
employees_2 = pd.read_json('employees.json')
employees_2

   id      name department  salary
0   1  C Ronald    Finance   22091
1   2   trump D         IT   87010
2   3   Biden J    Finance   99148

In [4]:
employees_3 = pd.read_xml('employees.xml')
employees_3

   id            name department  salary
0   1      Alice Kent    Finance   60000
1   2  Victor Johnson         IT   66010
2   3       J Johnson    Finance   11148

In [13]:
data_2 = pd.read_json('https://jsonplaceholder.typicode.com/posts')
data_2.head()

,userId,id,title,body
0,1,1,sunt aut facere repellat provident occaecati e...,quia et suscipit\nsuscipit recusandae consequu...
1,1,2,qui est esse,est rerum tempore vitae\nsequi sint nihil repr...
2,1,3,ea molestias quasi exercitationem repellat qui...,et iusto sed quo iure\nvoluptatem occaecati om...
3,1,4,eum et est occaecati,ullam et saepe reiciendis voluptatem adipisci\...
4,1,5,nesciunt quas odio,repudiandae veniam quaerat sunt sed\nalias aut...

In [22]:
user = 'YANSHENDONG'
password = 'Dd775852174110@'
account = 'yxnfyva-zx64702'
warehouse = None
database = 'YANSHEN_DIT'
schema = 'ETL_TASK'
role = 'ACCOUNTADMIN'

from  snowflake import connector

con = connector.connect(
    user=user,
    password=password,
    account=account,
    database=database,
    schema=schema,
    role=role
)

cursor = con.cursor()
cursor.execute('''
    select *
    from YANSHEN_DIT.ETL_TASKS.ACCOUNTS
''')
data_3 = pd.DataFrame(cursor, columns=[i[0] for i in cursor.description])
data_3.head()

,ID,NAME,WEBSITE,LAT,LONG,PRIMARY_POC,SALES_REP_ID
0,1001,Walmart,www.walmart.com,40.23849561,-75.10329704,Tamara Tuma,321500
1,1011,Exxon Mobil,www.exxonmobil.com,41.16915630,-73.84937379,Sung Shields,321510
2,1021,Apple,www.apple.com,42.29049481,-76.08400942,Jodee Lupo,321520
3,1031,Berkshire Hathaway,www.berkshirehathaway.com,40.94902131,-75.76389759,Serafina Banda,321530
4,1041,McKesson,www.mckesson.com,42.21709326,-75.28499823,Angeles Crusoe,321540

# Transform

In [25]:
data_1 = pd.concat([employees_1, employees_2, employees_3], ignore_index=True)
data_1

   id            name department  salary
0   1   Alice Johnson    Finance   50091
1   2   Alice Johnson         IT   57010
2   3   Alice Johnson    Finance   78148
3   1        C Ronald    Finance   22091
4   2         trump D         IT   87010
5   3         Biden J    Finance   99148
6   1      Alice Kent    Finance   60000
7   2  Victor Johnson         IT   66010
8   3       J Johnson    Finance   11148

# Load

In [24]:
from snowflake.connector.pandas_tools import write_pandas

cursor.execute(f'USE SCHEMA ASSIGNMENT2')

write_pandas(conn=con, df=data_1, table_name='EMPLOYEES', auto_create_table=True)
write_pandas(conn=con, df=data_2, table_name='POSTS', auto_create_table=True)
write_pandas(conn=con, df=data_3, table_name='ACCOUNTS', auto_create_table=True)

/var/folders/hk/p7fcnhm10z92trzs_9kwqlyr0000gn/T/ipykernel_95571/1701428968.py:6: UserWarning: Pandas Dataframe has non-standard index of type <class 'pandas.core.indexes.base.Index'> which will not be written. Consider changing the index to pd.RangeIndex(start=0,...,step=1) or call reset_index() to keep index as column(s)
  write_pandas(conn=con, df=data_2, table_name='POSTS', auto_create_table=True)

(True,
 1,
 351,
 [('zehqswlyvx/file0.txt', 'LOADED', 351, 351, 1, 0, None, None, None, None)])

In [27]:
write_pandas(conn=con, df=data_2, table_name='POSTS', auto_create_table=True)

100